Core/src/AccumulationRegisters/AzRyАналитикаРасчетыСПокупателями/AzRyАналитикаРасчетыСПокупателями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>AzRyАналитикаРасчетыСПокупателями</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРасчетов</name>
    <type>
      <types>EnumRef.ТипыРасчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПередачаВА</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ОтчетОПереработке</types>
      <types>DocumentRef.ПоступлениеВКассу</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.Взаимозачет</types>
      <types>DocumentRef.ПоступлениеНаСчет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/AccumulationRegisters/РасчетыСПокупателями/РасчетыСПокупателями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПокупателями</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРег</name>
    <comment>Сумма в регламентированной валюте</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРасчетов</name>
    <type>
      <types>EnumRef.ТипыРасчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПередачаВА</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ОтчетОПереработке</types>
      <types>DocumentRef.ПоступлениеВКассу</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ПриемИПередачаВРемонт</types>
      <types>DocumentRef.Взаимозачет</types>
      <types>DocumentRef.ПоступлениеНаСчет</types>
      <types>DocumentRef.ОперацияПоПлатежнымКартам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ПриемИПередачаВРемонт</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/AccumulationRegisters/AzRyАналитикаРасчетыСПокупателями/RecordSetModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ПередЗаписью набора записей.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
  ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
  ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Установка исключительной блокировки текущего набора записей регистратора.
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПокупателями.НаборЗаписей");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Регистратор", Отбор.Регистратор.Значение);
	Блокировка.Заблокировать();
	
	Если НЕ СтруктураВременныеТаблицы.Свойство("ДвиженияРасчетыСПокупателямиИзменение")
		ИЛИ	СтруктураВременныеТаблицы.Свойство("ДвиженияРасчетыСПокупателямиИзменение")
	   И НЕ СтруктураВременныеТаблицы.ДвиженияРасчетыСПокупателямиИзменение Тогда
		
		// Если временная таблица "ДвиженияРасчетыСПокупателямиИзменение" не существует или не содержит записей
		// об изменении набора, значит набор записывается первый раз или для набора был выполнен контроль остатков.
		// Текущее состояние набора помещается во временную таблицу "ДвиженияРасчетыСПокупателямиПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно текущего.
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	РегистрНакопленияРасчетыСПокупателями.НомерСтроки КАК НомерСтроки,
		|	РегистрНакопленияРасчетыСПокупателями.Организация КАК Организация,
		|	РегистрНакопленияРасчетыСПокупателями.Контрагент КАК Контрагент,
		|	РегистрНакопленияРасчетыСПокупателями.Договор КАК Договор,
		|	РегистрНакопленияРасчетыСПокупателями.Документ КАК Документ,
		|	РегистрНакопленияРасчетыСПокупателями.Заказ КАК Заказ,
		|	РегистрНакопленияРасчетыСПокупателями.ТипРасчетов КАК ТипРасчетов,
		|	ВЫБОР
		|		КОГДА РегистрНакопленияРасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА РегистрНакопленияРасчетыСПокупателями.Сумма
		|		ИНАЧЕ -РегистрНакопленияРасчетыСПокупателями.Сумма
		|	КОНЕЦ КАК СуммаПередЗаписью,
		|	ВЫБОР
		|		КОГДА РегистрНакопленияРасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА РегистрНакопленияРасчетыСПокупателями.СуммаВал
		|		ИНАЧЕ -РегистрНакопленияРасчетыСПокупателями.СуммаВал
		|	КОНЕЦ КАК СуммаВалПередЗаписью
		|ПОМЕСТИТЬ ДвиженияРасчетыСПокупателямиПередЗаписью
		|ИЗ
		|	РегистрНакопления.AzRyАналитикаРасчетыСПокупателями КАК РегистрНакопленияРасчетыСПокупателями
		|ГДЕ
		|	РегистрНакопленияРасчетыСПокупателями.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
				
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	Иначе
		
		// Если временная таблица "ДвиженияРасчетыСПокупателямиИзменение" существует и содержит записи
		// об изменении набора, значит набор записывается не первый раз и для набора не был выполнен контроль остатков.
		// Текущее состояние набора и текущее состояние изменений помещаются во временную таблцу "ДвиженияРасчетыСПокупателямиПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно первоначального.
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияРасчетыСПокупателямиИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияРасчетыСПокупателямиИзменение.Организация КАК Организация,
		|	ДвиженияРасчетыСПокупателямиИзменение.Контрагент КАК Контрагент,
		|	ДвиженияРасчетыСПокупателямиИзменение.Договор КАК Договор,
		|	ДвиженияРасчетыСПокупателямиИзменение.Документ КАК Документ,
		|	ДвиженияРасчетыСПокупателямиИзменение.Заказ КАК Заказ,
		|	ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов КАК ТипРасчетов,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
		|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалПередЗаписью КАК СуммаВалПередЗаписью
		|ПОМЕСТИТЬ ДвиженияРасчетыСПокупателямиПередЗаписью
		|ИЗ
		|	ДвиженияРасчетыСПокупателямиИзменение КАК ДвиженияРасчетыСПокупателямиИзменение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РегистрНакопленияРасчетыСПокупателями.НомерСтроки,
		|	РегистрНакопленияРасчетыСПокупателями.Организация,
		|	РегистрНакопленияРасчетыСПокупателями.Контрагент,
		|	РегистрНакопленияРасчетыСПокупателями.Договор,
		|	РегистрНакопленияРасчетыСПокупателями.Документ,
		|	РегистрНакопленияРасчетыСПокупателями.Заказ,
		|	РегистрНакопленияРасчетыСПокупателями.ТипРасчетов,
		|	ВЫБОР
		|		КОГДА РегистрНакопленияРасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА РегистрНакопленияРасчетыСПокупателями.Сумма
		|		ИНАЧЕ -РегистрНакопленияРасчетыСПокупателями.Сумма
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА РегистрНакопленияРасчетыСПокупателями.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА РегистрНакопленияРасчетыСПокупателями.СуммаВал
		|		ИНАЧЕ -РегистрНакопленияРасчетыСПокупателями.СуммаВал
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.AzRyАналитикаРасчетыСПокупателями КАК РегистрНакопленияРасчетыСПокупателями
		|ГДЕ
		|	РегистрНакопленияРасчетыСПокупателями.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
				
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	КонецЕсли;
	
	// Временная таблица "ДвиженияРасчетыСПокупателямиИзменение" уничтожается
	// Удаляется информация о ее существовании.
	
	Если СтруктураВременныеТаблицы.Свойство("ДвиженияРасчетыСПокупателямиИзменение") Тогда
		
		Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияРасчетыСПокупателямиИзменение");
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		СтруктураВременныеТаблицы.Удалить("ДвиженияРасчетыСПокупателямиИзменение");
	
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ПриЗаписи набора записей.
//
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
  ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
  ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу "ДвиженияРасчетыСПокупателямиИзменение".
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МИНИМУМ(ДвиженияРасчетыСПокупателямиИзменение.НомерСтроки) КАК НомерСтроки,
	|	ДвиженияРасчетыСПокупателямиИзменение.Организация КАК Организация,
	|	ДвиженияРасчетыСПокупателямиИзменение.Контрагент КАК Контрагент,
	|	ДвиженияРасчетыСПокупателямиИзменение.Договор КАК Договор,
	|	ДвиженияРасчетыСПокупателямиИзменение.Документ КАК Документ,
	|	ДвиженияРасчетыСПокупателямиИзменение.Заказ КАК Заказ,
	|	ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов КАК ТипРасчетов,
	|	СУММА(ДвиженияРасчетыСПокупателямиИзменение.СуммаПередЗаписью) КАК СуммаПередЗаписью,
	|	СУММА(ДвиженияРасчетыСПокупателямиИзменение.СуммаИзменение) КАК СуммаИзменение,
	|	СУММА(ДвиженияРасчетыСПокупателямиИзменение.СуммаПриЗаписи) КАК СуммаПриЗаписи,
	|	СУММА(ДвиженияРасчетыСПокупателямиИзменение.СуммаВалПередЗаписью) КАК СуммаВалПередЗаписью,
	|	СУММА(ДвиженияРасчетыСПокупателямиИзменение.СуммаВалИзменение) КАК СуммаВалИзменение,
	|	СУММА(ДвиженияРасчетыСПокупателямиИзменение.СуммаВалПриЗаписи) КАК СуммаВалПриЗаписи
	|ПОМЕСТИТЬ ДвиженияРасчетыСПокупателямиИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДвиженияРасчетыСПокупателямиПередЗаписью.НомерСтроки КАК НомерСтроки,
	|		ДвиженияРасчетыСПокупателямиПередЗаписью.Организация КАК Организация,
	|		ДвиженияРасчетыСПокупателямиПередЗаписью.Контрагент КАК Контрагент,
	|		ДвиженияРасчетыСПокупателямиПередЗаписью.Договор КАК Договор,
	|		ДвиженияРасчетыСПокупателямиПередЗаписью.Документ КАК Документ,
	|		ДвиженияРасчетыСПокупателямиПередЗаписью.Заказ КАК Заказ,
	|		ДвиженияРасчетыСПокупателямиПередЗаписью.ТипРасчетов КАК ТипРасчетов,
	|		ДвиженияРасчетыСПокупателямиПередЗаписью.СуммаПередЗаписью КАК СуммаПередЗаписью,
	|		ДвиженияРасчетыСПокупателямиПередЗаписью.СуммаПередЗаписью КАК СуммаИзменение,
	|		0 КАК СуммаПриЗаписи,
	|		ДвиженияРасчетыСПокупателямиПередЗаписью.СуммаВалПередЗаписью КАК СуммаВалПередЗаписью,
	|		ДвиженияРасчетыСПокупателямиПередЗаписью.СуммаВалПередЗаписью КАК СуммаВалИзменение,
	|		0 КАК СуммаВалПриЗаписи
	|	ИЗ
	|		ДвиженияРасчетыСПокупателямиПередЗаписью КАК ДвиженияРасчетыСПокупателямиПередЗаписью
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияРасчетыСПокупателямиПриЗаписи.НомерСтроки,
	|		ДвиженияРасчетыСПокупателямиПриЗаписи.Организация,
	|		ДвиженияРасчетыСПокупателямиПриЗаписи.Контрагент,
	|		ДвиженияРасчетыСПокупателямиПриЗаписи.Договор,
	|		ДвиженияРасчетыСПокупателямиПриЗаписи.Документ,
	|		ДвиженияРасчетыСПокупателямиПриЗаписи.Заказ,
	|		ДвиженияРасчетыСПокупателямиПриЗаписи.ТипРасчетов,
	|		0,
	|		ВЫБОР
	|			КОГДА ДвиженияРасчетыСПокупателямиПриЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ДвиженияРасчетыСПокупателямиПриЗаписи.Сумма
	|			ИНАЧЕ ДвиженияРасчетыСПокупателямиПриЗаписи.Сумма
	|		КОНЕЦ,
	|		ДвиженияРасчетыСПокупателямиПриЗаписи.Сумма,
	|		0,
	|		ВЫБОР
	|			КОГДА ДвиженияРасчетыСПокупателямиПриЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ДвиженияРасчетыСПокупателямиПриЗаписи.СуммаВал
	|			ИНАЧЕ ДвиженияРасчетыСПокупателямиПриЗаписи.СуммаВал
	|		КОНЕЦ,
	|		ДвиженияРасчетыСПокупателямиПриЗаписи.СуммаВал
	|	ИЗ
	|		РегистрНакопления.AzRyАналитикаРасчетыСПокупателями КАК ДвиженияРасчетыСПокупателямиПриЗаписи
	|	ГДЕ
	|		ДвиженияРасчетыСПокупателямиПриЗаписи.Регистратор = &Регистратор) КАК ДвиженияРасчетыСПокупателямиИзменение
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияРасчетыСПокупателямиИзменение.Организация,
	|	ДвиженияРасчетыСПокупателямиИзменение.Контрагент,
	|	ДвиженияРасчетыСПокупателямиИзменение.Договор,
	|	ДвиженияРасчетыСПокупателямиИзменение.Документ,
	|	ДвиженияРасчетыСПокупателямиИзменение.Заказ,
	|	ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ДвиженияРасчетыСПокупателямиИзменение.СуммаИзменение) <> 0
	|		ИЛИ СУММА(ДвиженияРасчетыСПокупателямиИзменение.СуммаВалИзменение) <> 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	Договор,
	|	Документ,
	|	Заказ,
	|	ТипРасчетов");
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаИзРезультатаЗапроса.Следующий();
	
	// Новые изменения были помещены во временную таблицу "ДвиженияРасчетыСПокупателямиИзменение".
	// Добавляется информация о ее существовании и наличии в ней записей об изменении.
	СтруктураВременныеТаблицы.Вставить("ДвиженияРасчетыСПокупателямиИзменение", ВыборкаИзРезультатаЗапроса.Количество > 0);
	
	// Временная таблица "ДвиженияРасчетыСПокупателямиПередЗаписью" уничтожается
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияРасчетыСПокупателямиПередЗаписью");
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры // ПриЗаписи()
